# -*- coding:utf-8 -*-
NameMap = {
    '42个本市重点建设发展的小城镇': 'littletown',
    '2009年北京市农业技术推广奖获奖清单': '2009nyhj',
    '2009年中关村高端领军人才人员名单': '2009gdrc',
    '2010年北京市农业技术推广奖推荐获奖成果名录': '2010nyhj',
    '2010年第二批中关村高端领军人才人员名单': '2010gdrc2',
    '2010年第一批中关村高端领军人才人员名单': '2010gdrc1',
    '2011年第二批中关村高端领军人才人员名单': '2011gdrc2',
    '2011年第一批中关村高端领军人才人员名单': '2011gdrc1',
    '2012年第一批中关村高端领军人才人员名单': '2012gdrc1',
    '2012年度市级环境优美乡镇和市级生态村名单': '2012ymxz',
    '2012年中关村高新技术企业名单': '2012zgcgkj',
    '2013年北京市工程技术系列(林业、水产)高级专业技术资格通过人员名单': '2013gcjs',
    '2013年北京市农业技术系列高级专业技术资格通过人员名单': '2013nyjs',
    '保健食品经营单位': 'bjpjy',
    '保健食品生产单位': 'bjpsc',
    '报纸出版单位': 'bzcb',
    '北京地区博物馆': 'bjbwg',
    '北京侨商会': 'bjqsh',
    '北京人家': 'bjrj',
    '北京市“十二五”期间全国少数民族特需商品定点生产企业汇总表': '125ssmz',

}
