# -*- coding:utf-8 -*-

#存储分区的左下右上坐标（百度）
religions = {
    1: ['39.768', '116.06', '39.836', '116.198'],
    2: ['39.768', '116.198', '39.836', '116.336'],
    3: ['39.768', '116.336', '39.836', '116.474'],
    4: ['39.836', '116.06', '39.904', '116.198'],
    5: ['39.836', '116.198', '39.904', '116.336'],
    6: ['39.836', '116.336', '39.904', '116.474']
}

#关键字类型
catalogs = {
    1: ['政府'],
    2: ['幼儿园', '小学', '中学', '大学', '职业学院', '科研机构'],
    3: ['名胜古迹'],
    4: ['医院', '动物医院', '药店'],
    5: ['饭店', '餐馆', '酒吧', '咖啡', '面包', '茶馆'],
    6: ['商场', '便利店', '超市'],
    7: ['商品城', '建材', '花卉', '农贸市场'],
    8: ['书店'],
    9: ['报刊亭'],
    10: ['美术馆', '图书馆', '科技馆', '博物馆','展览馆'],
    11: ['出版社', '报社', '杂志社'],
    12: ['会议中心'],
    13: ['宾馆', '度假村', '农家院'],
    14: ['银行', 'atm', '证券', '典当', '贷款公司', '保险'],
    15: ['邮政'],
    16: ['房屋中介'],
    17: ['体育馆', '健身'],
    18: ['洗浴', '按摩足疗', 'ktv', '电影院', '剧场', '网吧'],
    19: ['美容美发'],
    20: ['洗衣店'],
    21: ['专卖店'],
    22: ['小区'],
    23: ['公园'],
    24: ['公共厕所'],
    25: ['加油站', '化工厂', '液化气'],
    26: ['公司'],
    27: ['中国移动', '中国联通', '中国电信']
}

#baidu api
BD_API_PLACE = 'http://api.map.baidu.com/place/v2/search?'
params = {
    'output': 'json',
    'ak': 'UjDN5L4WOmeoTAMIZG73MU1F',
    'page_num': '0',
    'page_size': '10'
}

#mysql
mysql_host = "localhost"
mysql_database = "bjdata"
mysql_user = "root"
mysql_password = "ronald"
mysql_tablename = "bdditu1"

