# -*- coding:utf-8 -*-

#存储分区的左下右上坐标（百度）
religions = {
    1: ['39.768', '116.06', '39.836', '116.198'],
    2: ['39.768', '116.198', '39.836', '116.336'],
    3: ['39.768', '116.336', '39.836', '116.474'],
    4: ['39.836', '116.06', '39.904', '116.198'],
    5: ['39.836', '116.198', '39.904', '116.336'],
    6: ['39.836', '116.336', '39.904', '116.474']
}

#关键字类型
# catalogs = {
#     1: ['政府'],
#     2: ['幼儿园', '小学', '中学', '大学', '职业学院', '科研机构'],
#     3: ['名胜古迹'],
#     4: ['医院', '动物医院', '药店'],
#     5: ['饭店', '餐馆', '酒吧', '咖啡', '面包', '茶馆'],
#     6: ['商场', '便利店', '超市'],
#     7: ['商品城', '建材', '花卉', '农贸市场'],
#     8: ['书店'],
#     9: ['报刊亭'],
#     10: ['美术馆', '图书馆', '科技馆', '博物馆','展览馆'],
#     11: ['出版社', '报社', '杂志社'],
#     12: ['会议中心'],
#     13: ['宾馆', '度假村', '农家院'],
#     14: ['银行', 'atm', '证券', '典当', '贷款公司', '保险'],
#     15: ['邮政'],
#     16: ['房屋中介'],
#     17: ['体育馆', '健身'],
#     18: ['洗浴', '按摩足疗', 'ktv', '电影院', '剧场', '网吧'],
#     19: ['美容美发'],
#     20: ['洗衣店'],
#     21: ['专卖店'],
#     22: ['小区'],
#     23: ['公园'],
#     24: ['公共厕所'],
#     25: ['加油站', '化工厂', '液化气'],
#     26: ['公司'],
#     27: ['中国移动', '中国联通', '中国电信']
# }

catalogs = {
    'A1': ['政府'],
    'A21': ['博物馆', '图书馆', '展览馆', '美术馆', '会展'],
    'A22': ['文化馆'],
    'A31': ['大学'],
    'A32': ['职业学校', '技工学校'],
    'A33': ['中学', '小学', '幼儿园'],
    'A34': ['特殊学校'],
    'A35': ['科研机构'],
    'A4': ['体育场', '游泳馆', '羽毛球馆', '溜冰场', '网球场', '足球场', '乒乓球场', '保龄球场'],
    'A5': ['医院'],
    'A6': ['养老院', '福利院', '孤儿院', '残疾人'],
    'A7': ['文物古迹'],
    'A8': ['社区服务'],
    'A9': ['庙', '教堂', '道观'],
    'B11': ['商场', '超市', '专卖店', '便利店'],
    'B12': ['建材', '花卉', '农贸市场'],
    'B13': ['饭店', '餐馆', '酒吧', '咖啡', '茶馆'],
    'B14': ['宾馆', '招待所', '度假村'],
    'B21': ['金融保险'],
    'B22': ['新闻出版', '广告传媒', '广播'],
    'B23': ['设计'],
    'B29': ['商贸'],
    'B3': ['娱乐'],
    'B9': ['电信', '供水', '燃气', '供电', '旅游信息', '培训', '诊所', '汽车维修', '美容美发', '洗衣', '公共厕所'],
    'G1': ['公园'],
    'M': ['工厂'],
    'R': ['居民区'],
    'S3': ['公交场站', '公交枢纽', '出租车停车场', '公交车站'],
    'S4': ['停车场']
}

#baidu api
BD_API_PLACE = 'http://api.map.baidu.com/place/v2/search?'
params = {
    'output': 'json',
    'ak': 'UjDN5L4WOmeoTAMIZG73MU1F',
    'page_num': '0',
    'page_size': '10'
}

#mysql
mysql_host = "localhost"
mysql_database = "bjdata"
mysql_user = "root"
mysql_password = "ronald"
mysql_tablename = "bdditu1"

